//
// Created by hualong on 2019/4/1.
//
#include <iostream>
using namespace std;
/*
 * ************************************************
 * 问题描述：
 * 给定一个`整数数组` nums 和一个目标值 target，请你在该数组中找出和为目标值
 * @ 给定 nums = [2, 7, 11, 15], target = 9
 * @ 返回值：[0, 1]
 * ************************************************
 */
class Solution {
public:
// 方法描述：


};


int main()
{
    //输入
    vector<int> inputNums{-1,-2,-3,-4,-5};



    Solution solution;




    return 0;
}





/* *********************************************
 * 测试用例：
 * [-1,-2,-3,-4,-5]  -8  ==>  [2,4]
 *
 * *********************************************
 */