
/* *********************************************************
 * 问题描述：
 *
 * 
 * *********************************************************
 */

#include <iostream>
#include <vector>
#include <list>   //容易删改 方便前后删除
#include <deque>
using namespace std;


class Solution{
public:
    void function(int num){

    }
};

int main() {
    Solution solution;

    std::cout << " " << std::endl;

    return 0;

}
/* *********************************************************
 * 解题思路：
 *
 * ----------------------------------
 * 测试示例：
 *
 * *********************************************************
 */